metadata-api-deleteMetadata.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:met="http://soap.sforce.com/2006/04/metadata" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header>
        <met:SessionHeader>
            <met:sessionId>{{SessionId}}</met:sessionId>
        </met:SessionHeader>
    </soapenv:Header>
    <soapenv:Body>
        <met:deleteMetadata>
            <met:type>CustomObject</met:type>
                <fullName>Invoice_Header__c</fullName>
                <fullName>Invoice_Detail__c</fullName>
        </met:deleteMetadata>
    </soapenv:Body>
</soapenv:Envelope>
